from aiogram import Bot


DEBUG = True
DB_PASSWORD = ''

# get from .env
bot = Bot(token='')

# get from .env
payment_token = ''

yan_maps_navigate_url = 'https://yandex.ru/maps/?rtext={0},{1}~{2},{3}&rtt=auto'
yan_maps_point_url = 'https://maps.yandex.ru//?pt={1},{0}&z=18&l=map'

republics = [
    'Ингушетия', 'Северная Осетия — Алания', 'Дагестан', 'Чечня', 'Кабардино-Балкария',
    'Карачаево-Черкесская Республика', 'Ставропольский край'
]


admins = [855151774, 326460830, 982616847]

admin_link = '@AaakkmmM'

time_coef = 3

ways = {
    2: 33.4,
    3: 32.67,
    4: 32,
    5: 30.5,
    6: 30.4,
    7: 29.3,
    8: 29.2,
    9: 29.12,
    10: 28.7,
    11: 28.4,
    12: 27.3,
    13: 26.3,
    14: 26.2,
    15: 25.7,
    16: 25.06,
    17: 24.9,
    18: 24.4,
    19: 23.9,
    20: 23.8,
    21: 23.23,
    22: 23.19,
    23: 22.66,
    24: 22.304,
    25: 22.125,
    26: 21.84,
    27: 21.5,
    28: 21.07,
    29: 21.07,
    30: 20.93,
    31: 20.63,
    32: 20.48,
    33: 20.34,
    34: 20.06,
    35: 19.94,
    36: 19.71,
    37: 19.52,
    38: 19.4,
    39: 19.26,
    40: 19.2,
    41: 19.15,
    42: 18.97,
    43: 18.83,
    44: 18.74,
    45: 18.61,
    46: 18.57,
    47: 18.41,
    48: 18.55,
    49: 18.16,
    50: 18.1
}

another_sum = 100
