from aiogram import Bot


bot = Bot(token='6188206507:AAH1du89pRXK3Hw3KXnlvDOYeU75X96tx5U')

payment_token = '1902332405:LIVE:638151872098154178'

republics = [
    'Ингушетия', 'Северная Осетия — Алания', 'Дагестан', 'Чечня', 'Кабардино-Балкария',
    'Карачаево-Черкесия', 'Карачаево-Черкесская Республика', 'Ставропольский край'
]

admins = [855151774, 326460830, 982616847]

admin_link = '@AaakkmmM'

time_coef = 3

ways = {
    2: 32.4,
    3: 31.67,
    4: 31,
    5: 29.5,
    6: 29.4,
    7: 28.3,
    8: 28.2,
    9: 28.12,
    10: 27.7,
    11: 27.4,
    12: 26.3,
    13: 25.3,
    14: 25.2,
    15: 24.7,
    16: 24.06,
    17: 23.9,
    18: 23.4,
    19: 22.9,
    20: 22.8,
    21: 22.23,
    22: 22.19,
    23: 21.66,
    24: 21.304,
    25: 21.125,
    26: 20.84,
    27: 20.5,
    28: 20.07,
    29: 20.07,
    30: 19.93,
    31: 19.63,
    32: 19.48,
    33: 19.34,
    34: 19.06,
    35: 18.94,
    36: 18.71,
    37: 18.52,
    38: 18.4,
    39: 18.26,
    40: 18.2,
    41: 18.15,
    42: 17.97,
    43: 17.83,
    44: 17.74,
    45: 17.61,
    46: 17.57,
    47: 17.41,
    48: 17.55,
    49: 17.16,
    50: 17.1
}

another_sum = 100
