from aiogram import Bot


bot = Bot(token='6188206507:AAH1du89pRXK3Hw3KXnlvDOYeU75X96tx5U')

payment_token = '1902332405:LIVE:638151872098154178'

republics = [
    'Ингушетия', 'Северная Осетия — Алания', 'Дагестан', 'Чечня', 'Кабардино-Балкария',
    'Карачаево-Черкесия', 'Кавказские Минеральные Воды', 'Ставропольский край'
]

admins = [855151774, 326460830, 982616847]

admin_link = '@AaakkmmM'

time_coef = 3

ways = {
    2: 19.4,
    3: 18.67,
    4: 17,
    5: 17,
    6: 17.8,
    7: 15.3,
    8: 15,
    9: 15.12,
    10: 14.7,
    11: 14.4,
    12: 13.3,
    13: 12.3,
    14: 12.2,
    15: 11.7,
    16: 11.06,
    17: 10.9,
    18: 10.4,
    19: 9.4,
    20: 9.8,
    21: 9.23,
    22: 9.19,
    23: 8.66,
    24: 8.304,
    25: 8.125,
    26: 7.84,
    27: 7.5,
    28: 7.07,
    29: 7.07,
    30: 6.93,
    31: 6.63,
    32: 6.48,
    33: 6.34,
    34: 6.06,
    35: 5.94,
    36: 5.71,
    37: 5.52,
    38: 5.4,
    39: 5.26,
    40: 5.2,
    41: 5.15,
    42: 4.97,
    43: 4.83,
    44: 4.74,
    45: 4.61,
    46: 4.57,
    47: 4.41,
    48: 4.55,
    49: 4.16,
    50: 4.51
}

another_sum = 100
