from aiogram import Bot


bot = Bot(token='6019030878:AAFoaqn3lOrXbwnvhSD_-g4BLQGP6GDTkZs')

payment_token = '1744374395:TEST:eda4edc2e768372bd2e6'

republics = [
    'Ингушетия', 'Северная Осетия — Алания', 'Дагестан', 'Чечня', 'Кабардино-Балкария',
    'Карачаево-Черкесия', 'Кавказские Минеральные Воды'
]

admin_link = '@bluabitch, @AaakkmmM'

time_coef = 3

ways = {
    2: 19.4,
    3: 18.67,
    4: 17,
    6: 17.8,
    8: 15,
    10: 14.7,
    12: 13.3,
    14: 12.2,
    16: 11.06,
    18: 10.4,
    20: 9.8,
    22: 9.19,
    24: 8.304,
    26: 7.84,
    28: 7.29,
    30: 6.93,
    32: 6.48,
    34: 6.06,
    36: 5.71,
    38: 5.4,
    40: 5.2,
    42: 4.97,
    44: 4.74,
    46: 4.57,
    48: 4.55,
    50: 4.51
}
